In [1]:
'''
    #       # #   # ##### ####### #
    # #   # # \  /  #     #     # #
    #   #   #  \/   ##### #     # #
    #       #  #        # #  #### #
    #       #  #    ##### ####### ######
    
   Author name: Tarun Sharma 
   Schema Name: Scientists And Projects
  All are done in mysql using pymysql library especially because to write in Jupyter notebook.

'''    
import sqlalchemy
import pymysql
pymysql.install_as_MySQLdb()
sqlalchemy.create_engine('mysql://root:root@localhost/Scientist')
%load_ext sql
%sql mysql://root:root@localhost/Scientist

In [3]:
%%sql
create table Scientists (
  SSN int,
  Name Char(30) not null,
  Primary Key (SSN)
);

 * mysql://root:***@localhost/Scientist
0 rows affected.

[]

In [4]:
%%sql
Create table Projects (
  Code Char(4),
  Name Char(50) not null,
  Hours int,
  Primary Key (Code)
);

 * mysql://root:***@localhost/Scientist
0 rows affected.

[]

In [5]:
%%sql
create table AssignedTo (
  Scientist int not null,
  Project char(4) not null,
  Primary Key (Scientist, Project),
  Foreign Key (Scientist) references Scientists (SSN),
  Foreign Key (Project) references Projects (Code)
);

 * mysql://root:***@localhost/Scientist
0 rows affected.

[]

In [6]:
%%sql
INSERT INTO Scientists(SSN,Name) 
  VALUES(123234877,'Michael Rogers'),
    (152934485,'Anand Manikutty'),
    (222364883, 'Carol Smith'),
    (326587417,'Joe Stevens'),
    (332154719,'Mary-Anne Foster'),	
    (332569843,'George ODonnell'),
    (546523478,'John Doe'),
    (631231482,'David Smith'),
    (654873219,'Zacary Efron'),
    (745685214,'Eric Goldsmith'),
    (845657245,'Elizabeth Doe'),
    (845657246,'Kumar Swamy');

 * mysql://root:***@localhost/Scientist
12 rows affected.

[]

In [7]:
%%sql
 INSERT INTO Projects ( Code,Name,Hours)
 VALUES ('AeH1','Winds: Studying Bernoullis Principle', 156),
       ('AeH2','Aerodynamics and Bridge Design',189),
       ('AeH3','Aerodynamics and Gas Mileage', 256),
       ('AeH4','Aerodynamics and Ice Hockey', 789),
       ('AeH5','Aerodynamics of a Football', 98),
       ('AeH6','Aerodynamics of Air Hockey',89),
       ('Ast1','A Matter of Time',112),
       ('Ast2','A Puzzling Parallax', 299),
       ('Ast3','Build Your Own Telescope', 6546),
       ('Bte1','Juicy: Extracting Apple Juice with Pectinase', 321),
       ('Bte2','A Magnetic Primer Designer', 9684),
       ('Bte3','Bacterial Transformation Efficiency', 321),
       ('Che1','A Silver-Cleaning Battery', 545),
       ('Che2','A Soluble Separation Solution', 778);

 * mysql://root:***@localhost/Scientist
14 rows affected.

[]

In [8]:
%%sql
 INSERT INTO AssignedTo ( Scientist, Project)
   VALUES (123234877,'AeH1'),
    (152934485,'AeH3'),
    (222364883,'Ast3'),	   
    (326587417,'Ast3'),
    (332154719,'Bte1'),
    (546523478,'Che1'),
    (631231482,'Ast3'),
    (654873219,'Che1'),
    (745685214,'AeH3'),
    (845657245,'Ast1'),
    (845657246,'Ast2'),
    (332569843,'AeH4');

 * mysql://root:***@localhost/Scientist
12 rows affected.

[]

In [9]:
%%sql
-- List all the scientists' names, their projects' names, 
-- and the hours worked by that scientist on each project, 
-- in alphabetical order of project name, then scientist name.

SELECT   S.Name, P.Name, P.Hours
FROM     Scientists S 
         INNER JOIN AssignedTo A ON S.SSN=A.Scientist
         INNER JOIN Projects P ON A.Project=P.Code
ORDER BY P.Name ASC, S.Name ASC;

 * mysql://root:***@localhost/Scientist
12 rows affected.

[('Elizabeth Doe', 'A Matter of Time', 112),
 ('Kumar Swamy', 'A Puzzling Parallax', 299),
 ('John Doe', 'A Silver-Cleaning Battery', 545),
 ('Zacary Efron', 'A Silver-Cleaning Battery', 545),
 ('Anand Manikutty', 'Aerodynamics and Gas Mileage', 256),
 ('Eric Goldsmith', 'Aerodynamics and Gas Mileage', 256),
 ('George ODonnell', 'Aerodynamics and Ice Hockey', 789),
 ('Carol Smith', 'Build Your Own Telescope', 6546),
 ('David Smith', 'Build Your Own Telescope', 6546),
 ('Joe Stevens', 'Build Your Own Telescope', 6546),
 ('Mary-Anne Foster', 'Juicy: Extracting Apple Juice with Pectinase', 321),
 ('Michael Rogers', 'Winds: Studying Bernoullis Principle', 156)]

In [10]:
%%sql
-- Select the project names which are not assigned yet
SELECT Name 
FROM Projects
WHERE Code NOT In
(
SELECT Project 
         FROM AssignedTo
);

 * mysql://root:***@localhost/Scientist
6 rows affected.

[('Aerodynamics and Bridge Design',),
 ('Aerodynamics of a Football',),
 ('Aerodynamics of Air Hockey',),
 ('A Magnetic Primer Designer',),
 ('Bacterial Transformation Efficiency',),
 ('A Soluble Separation Solution',)]

# We will update more queries and till then think more about schema And 
# try to get more queries in mind.....